Revit 2027 API
AreaFilter Constructor
 Constructs a filter which matches only areas.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AreaFilter()
Public Sub New
public:
AreaFilter()
new : unit -> AreaFilter
See Also
Reference
AreaFilter Class
Autodesk.Revit.DB Namespace